package homework_1;

/*В переменной n хранится вещественное число с ненулевой дробной частью.
        Создайте программу, которая округляет число n до ближайшего целого и
выводящую результат на экран.*/
public class Task_1_4 {
    float n = 15.8f;

    public void sum4() {
    int a = Math.round(n);
        System.out.println(a);
    }
}
